opengl_triangle.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ch" xml:lang="ch">
<head>
<title>在3D空间中绘制三角形</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="在3D空间中绘制三角形"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-18 14:49:09 CST"/>
<meta name="author" content="Joseph Pan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./other/style.css" type="text/css"/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="./opengl_index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">在3D空间中绘制三角形</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 三角形：第一种多边形</a></li>
<li><a href="#sec-2">2 正反面：环绕</a></li>
<li><a href="#sec-3">3 三角形带</a></li>
<li><a href="#sec-4">4 三角形扇</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 三角形：第一种多边形</h2>
<div class="outline-text-2" id="text-1">


<p>  
  <code>GL_TRIANGLES</code> 图元通过连接3个顶点绘制三角形。下面这段代码绘制了两个三角形，每个三角形使用了3个顶点：
</p>



<pre class="src src-c">glBegin(GL_TRIANGLES);
      glVertex2f(0.0f, 0.0f);         <span style="color: #ffd700;">// </span><span style="color: #ffd700;">V0</span>
      glVertex2f(25.0f, 25.0f);       <span style="color: #ffd700;">// </span><span style="color: #ffd700;">V1</span>
      glVertex2f(50.0f, 0.0f);        <span style="color: #ffd700;">// </span><span style="color: #ffd700;">V2</span>

      glVertex2f(-50.0f, 0.0f);       <span style="color: #ffd700;">// </span><span style="color: #ffd700;">V3</span>
      glVertex2f(-75.0f, 50.0f);      <span style="color: #ffd700;">// </span><span style="color: #ffd700;">V4</span>
      glVertex2f(-25.0f, 0.0f);       <span style="color: #ffd700;">// </span><span style="color: #ffd700;">V5</span>
glEnd();
</pre>


<pre class="example">
两个使用GL_TRIANGLES绘制               
的三角形                              | y
                     v4--            |  
                        \\--   2     |       v1   
                         \  \-       | 1   /--    2
                       1  \   \--    | /---   \--- 
                        ---\-----\---+------------\- x
                           v3  3  v5 |v0    3      v2
                                     |
                                     |
                                     |
                                     |
</pre>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 正反面：环绕</h2>
<div class="outline-text-2" id="text-2">



<p>
  顶点的指定次序以及方向的组合称为环绕（winding）。上图中的两个三角形 <code>（v0-&gt;v1-&gt;v2）</code> , <code>(v3-&gt;v4-&gt;v5)</code> 被认为具有顺时针方向的环绕，因为它们都是按照顺时针方向进行绘制的。这是由顶点的指定顺序决定的。
</p>
<p>
  在默认情况下，OpenGL认为 <b>逆时针方向环绕的一面是多边形的正面</b> 。在一个场景中，使所有的多边形保持环绕方向的一致并使用正面多边形来绘制所有实心物体的外表面是非常重要的。
</p>
<p>
  如果想改变OpenGL的这个默认行为，可以调用 <code>glFrontFace</code> 函数。
</p>



<pre class="src src-c">glFrontFace(GL_CW);
</pre>


<p>
  GL_CW参数告诉OpenGL顺时针环绕的多边形将被认为是正面的。为了把多边形的正面重新恢复为逆时针环绕，可以在这个函数中使用GL_CCW参数。
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 三角形带</h2>
<div class="outline-text-2" id="text-3">



<p>  
  使用 <code>GL_TRIANGLE_STRIP</code> 图元，可以绘制一串相连的三角形，从而节省大量的时间。下图显示了一组5个顶点（标号从V0至V4）所指定的3个三角形的绘制过程。在此，读者可以看到这些顶点并不是按照它们的指定顺序进行遍历的，这是为了保持每个三角形的环绕方向（逆时针）。它的绘制模式是V0、V1、V2，接着是V2、V1、V3,然后是V2、V3、V4,以此类推。
</p>
<pre class="example">

                                                           v4
                                                          -- 
                                                     3  -/  \  2   
                                 3                    -/     -\    
         v2              v2 ----------- v3       v2  /---------\ v3
        /\                 /\       -/              /\   1   -/         
  3   /-  \  2           /-  \1    -/ 2           /-  \     -/          
    /-     \           /-     \  -/             /-     \  -/            
   ----------         ---------\/              ---------\/              
  v0   1     v1     v0         v1            v0         v1
                                                        
(v0-&gt;v1-&gt;v2-&gt;v0)   (v2-&gt;v1-&gt;v3-&gt;v2）           (v2-&gt;v3-&gt;v4-&gt;v2) 

</pre>



</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 三角形扇</h2>
<div class="outline-text-2" id="text-4">


<p>
  除了三角形带之外，还可以使用 <code>GL_TRIANGLE_FAN</code> 创建一组围绕一个中心点的相连三角形。
</p>
<p>
  下图显示了通过指定4个顶点所产生的包括3个三角形的三角形扇。用前3个顶点制定了第1个三角形之后，后续的每个顶点和原点（V0）以及前驱的那个顶点（Vn-1）形成了接下来的那个三角形。
</p>
<pre class="example">

     v1             v1                  v1    
      +\   2         +\                  +\                   
      | ---\         | ---\              | ---\  v2          
   1  |     --- v2   |     -\--          |     -\--          
      |   /--        |  1 /---\  2       |    /---\          
      | /- 3         | /-      --\       | /-   1  --\    
      --             ---------------     -------------/-  
      v0             v0     3      v3   v0  \---   /--  v3
                                            3   \--  2
                                                 v4  
</pre>



</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-18 14:49:09 CST</p>
<p class="author">Author: Joseph Pan</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
